it's a begginer level notebook. it discuss garbage collection and gc module in python.

In [1]:
import datatable as dt
import pandas as pd

In [2]:
data = dt.fread('car-sales.csv').to_pandas()
data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [3]:
data_2 = data

In [4]:
print(id(data))
print(id(data_2))

140582066673120
140582066673120

**it's the same address, so changing in one means change in the other**

In [5]:
data['omar'] = 'omar'

In [6]:
display(data.head(1))
display(data_2.head(1))

     Make Colour  Odometer (KM)  Doors      Price  omar
0  Toyota  White         150043      4  $4,000.00  omar

     Make Colour  Odometer (KM)  Doors      Price  omar
0  Toyota  White         150043      4  $4,000.00  omar

**but using the copy() method it creates a totally different variable**

In [7]:
data_3 = data.copy()
data_3.head(1)

     Make Colour  Odometer (KM)  Doors      Price  omar
0  Toyota  White         150043      4  $4,000.00  omar

In [8]:
print(id(data))
print(id(data_2))
print(id(data_3))

140582066673120
140582066673120
140580700701360

In [9]:
data_2["hatem"] = "hatem"

In [10]:
display(data.head(1))
display(data_2.head(1))

     Make Colour  Odometer (KM)  Doors      Price  omar  hatem
0  Toyota  White         150043      4  $4,000.00  omar  hatem

     Make Colour  Odometer (KM)  Doors      Price  omar  hatem
0  Toyota  White         150043      4  $4,000.00  omar  hatem

In [11]:
data.drop('omar', axis=1, inplace=True)

In [12]:
display(data.head(1))
display(data_2.head(1))

     Make Colour  Odometer (KM)  Doors      Price  hatem
0  Toyota  White         150043      4  $4,000.00  hatem

     Make Colour  Odometer (KM)  Doors      Price  hatem
0  Toyota  White         150043      4  $4,000.00  hatem

In [13]:
data = data.drop('hatem', axis=1)

In [14]:
display(data.head(1))
display(data_2.head(1))

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00

     Make Colour  Odometer (KM)  Doors      Price  hatem
0  Toyota  White         150043      4  $4,000.00  hatem

# What if we split the data does it change the address?

In [16]:
X = data.drop('Price', axis=1)
y = data['Price']

In [17]:
print(id(X))
print(id(y))
print(id(data))

140580700703520
140580700702416
140580700805968

In [18]:
## trying it with simple variables
a = 1
b = a
c = a + 1

print(id(a))
print(id(b))
print(id(c))

a = a+1

print()
print(id(a))
print(id(b))
print(id(c))

140582121892144
140582121892144
140582121892176

140582121892176
140582121892144
140582121892176

In [19]:
## trying it with simple variables
a = 1
b = a
c = a + 1

print(id(a))
print(id(b))
print(id(c))

a = b+1

print()
print(id(a))
print(id(b))
print(id(c))

140582121892144
140582121892144
140582121892176

140582121892176
140582121892144
140582121892176

**so any thing in the the rhs will evaluate as a new variable, therefore new memory address**

Just noticed that increasing the value of a by 1 (the same as c) will make the address of a and c the same.

Does that mean Python will create one memory slot for a specific value and any variable with that value will get the same address?

In [20]:
d = 2
print(id(d))

140582121892176

it looks like it. i'm impressed ngl

i read a little into an [article](https://stackify.com/python-garbage-collection/#wpautbox_about) about python garbage collection.

What i got is, yes, it allocate only one memory slot for the object and in the underlying layers it got something called reference count, where it keeps count of all the object uses this memory slot and when the count is equal to 0 it deallocate it immediatly.

In [49]:
import sys
sys.getrefcount(2)
e = 2
sys.getrefcount(2)
del e
sys.getrefcount(2)

1932

1933

1932

from this [article](https://www.pythonpool.com/python-clear-memory/)
> We have seen a lot of examples to clear the memory by using the del method. After using this type of statement, the objects are no longer accessible for the given code. But, the objects are still there in the memory.